chore: Add new server log entries and make a trivial update to the README.
